---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Diameter
zh: 直径、管径
source: html/a9b21020-4dc3-4ba3-eb23-1ac40a2366bf.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Diameter Property

**中文**: 直径、管径

The connector diameter, Units:(ft).

## Syntax (C#)
```csharp
public double Diameter { get; }
```